Revit 2026 API

# ViewSetNonControlledTemplateParameterIds Method

---
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public void SetNonControlledTemplateParameterIds(
	ICollection<ElementId> newSet
)
```
```vb
Public Sub SetNonControlledTemplateParameterIds (
	newSet As ICollection(Of ElementId)
)
```
```cpp
public:
void SetNonControlledTemplateParameterIds(
	ICollection<ElementId^>^ newSet
)
```
```fsharp
member SetNonControlledTemplateParameterIds :
        newSet : ICollection<ElementId> -> unit
```

#### Parameters

newSet ICollectionElementId

#### Reference

View Class

Autodesk.Revit.DB Namespace